#+BEGIN_COMMENT
.. title: Altair Tutorial: Cars
.. slug: altair-tutorial-cars
.. date: 2021-12-29 17:54:40 UTC-08:00
.. tags: altair,tutorial,visualization
.. category: Visualization
.. link: 
.. description: A look at the first part of the altair tutorial using the cars dataset.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-353247fc-9f67-4b91-9ca1-25f38122cbe1-ssh.json
#+OPTIONS: ^:{}

#+TOC: headlines 3

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
* The Data
  The data appears to come from the [[http://lib.stat.cmu.edu/datasets/][StatLib]] page. Here's the description.

#+begin_quote
This was the 1983 ASA Data Exposition dataset. The dataset was collected by Ernesto Ramos and David Donoho and dealt with automobiles. I don't remember the instructions for analysis. Data on mpg, cylinders, displacement, etc. (8 variables) for 406 different cars. The dataset includes the names of the cars.
#+end_quote

#+begin_src python :results output raw :exports both
cars = data.cars()
print(tabulate(cars.head(), showindex=False, tablefmt="orgtbl", headers="keys"))
#+end_src

#+RESULTS:
| Name                      |   Miles_per_Gallon |   Cylinders |   Displacement |   Horsepower |   Weight_in_lbs |   Acceleration | Year                | Origin   |
|---------------------------+--------------------+-------------+----------------+--------------+-----------------+----------------+---------------------+----------|
| chevrolet chevelle malibu |                 18 |           8 |            307 |          130 |            3504 |           12   | 1970-01-01 00:00:00 | USA      |
| buick skylark 320         |                 15 |           8 |            350 |          165 |            3693 |           11.5 | 1970-01-01 00:00:00 | USA      |
| plymouth satellite        |                 18 |           8 |            318 |          150 |            3436 |           11   | 1970-01-01 00:00:00 | USA      |
| amc rebel sst             |                 16 |           8 |            304 |          150 |            3433 |           12   | 1970-01-01 00:00:00 | USA      |
| ford torino               |                 17 |           8 |            302 |          140 |            3449 |           10.5 | 1970-01-01 00:00:00 | USA      |

#+begin_src python :results output :exports both
print(cars.shape)
#+end_src

#+RESULTS:
: (406, 9)

It's not a huge dataset but it will do for this demo.

